package com.developcollect.easycode.core.fakedata;

import cn.hutool.core.util.RandomUtil;

/**
 * @author Zhu KaiXiao
 * @version 1.0
 * @date 2021/4/13 9:46
 */
public class CompanyDbDataFaker implements IDbDataFaker {

    private String[] companyPrefixes = new String[]{
            "超艺", "和泰", "九方", "鑫博腾飞", "戴硕电子", "济南亿次元",
            "海创", "创联世纪", "凌云", "泰麒麟", "彩虹", "兰金电子",
            "晖来计算机", "天益", "恒聪百汇", "菊风公司", "惠派国际公司",
            "创汇", "思优", "时空盒数字", "易动力", "飞海科技", "华泰通安",
            "盟新", "商软冠联", "图龙信息", "华远软件", "创亿",
            "时刻", "开发区世创", "明腾", "良诺", "天开", "毕博诚", "快讯",
            "凌颖信息", "黄石金承", "恩悌", "雨林木风计算机", "双敏电子",
            "维旺明", "网新恒天", "数字100", "飞利信", "立信电子", "联通时科",
            "中建创业", "新格林耐特", "新宇龙信息", "浙大万朋", "MBP软件",
            "昂歌信息", "万迅电脑", "方正科技", "联软", "七喜", "南康", "银嘉",
            "巨奥", "佳禾", "国讯", "信诚致远", "浦华众城", "迪摩", "太极",
            "群英", "合联电子", "同兴万点", "襄樊地球村", "精芯", "艾提科信",
            "昊嘉", "鸿睿思博", "四通", "商软冠联", "诺依曼软件",
            "东方峻景", "华成育卓", "趋势", "维涛", "通际名联", "易联", "艺博", "捷诚", "欣兴旺",
            "台东泰", "辉华", "安安美", "润耀", "晶优", "一胜", "百名", "万合晶", "邦远", "多春如", "万晟",
            "诺顿", "凯干", "益百永", "丰辉欣", "栩翔", "启明", "荣彩", "丰缘", "白帆",
            "公如聚", "扬识", "新东", "捷飞", "盈成", "同进千", "驰阳", "和美", "裕美", "尊海",
            "用磊", "霸耀", "浩美", "亨鑫仁", "永利", "理京", "明盛", "信义", "本万飞", "宝高",
            "辉皇国", "江晶", "禄捷茂", "绿欣苑", "怡润", "贵全", "贝名", "洪德成", "同益", "旋吉",
            "合盛", "勤裕鼎", "尼鸿", "皇源", "啸创", "索非亚皮革制品", "聚美乐", "高如盈", "宝驰五金",
            "鸿泰", "格领", "东艾", "森利", "先卓", "利晟", "同通", "富长盛", "芯达", "精典", "尼佳",
            "益复捷", "生德", "晶长", "森益", "金伙伴", "德光", "茂全", "鲜派", "信顺康", "龙丝",
            "新耀协", "佳丽", "昇晖", "佳洲", "森道尔", "皇祥千", "润飞昌", "福中荣", "基玉", "如和",
            "茂乾", "翔鹏", "南湘", "谦圣泰", "吉春", "如本寿", "亚义金", "源耀浩", "邦洁", "宝复", "洪进贵",
            "永泰满", "显郦", "华行", "韵仪", "格派", "晶佩", "迪和", "领速", "贝耀", "信华诚", "世力", "舜杰",
            "久福", "曼新", "仁大兴", "金祥元", "泰伟飞", "亚和金", "吉振", "和伟中", "盛金缘", "立韦", "宏久",
            "吉至", "曼展", "天联", "金涛", "网诚", "系广", "圣金龙", "易露发", "嘉利华", "聚顿", "公同宏",
            "威邦", "力涛", "恒蓝", "铭航", "中美公", "永逸", "同捷", "发和", "易龙", "汉金", "干亚", "翔洋",
            "新都", "茂进永", "达通", "娇罗", "浩中和", "东升", "龙姿", "隆新弘", "鑫仟顺", "越福", "川实", "中协吉",
            "霸辉", "洪谦", "裕飞", "建富", "华缘", "三鑫", "鑫旭", "娇名", "乾富隆", "林霆", "弘源高", "荣子", "九紫星",
            "蓝珀", "兴昌信", "欧科", "生锋", "优义浩", "泰满正", "思之创", "火嘉", "理磊", "湘华", "名都", "威嘉",
            "丰南区兆国", "艾能", "圣金龙", "万码", "攀枝花", "宏丰", "新欧", "汇万", "大复", "天影", "玉基",
            "康冠", "大帆", "凌雷", "天天颖", "伟庆成", "佰盛", "优益晶", "春盈生", "千万巨", "瑞凤", "金永康",
            "多优多", "理识", "本成优", "寿旺鼎", "频光", "方元", "千佳同", "蚂蚁", "高义兴", "福泰", "辰丰",
            "兴新干", "运易", "荣祥", "诚亚", "五湖", "欣圣干", "冠坚", "拓嘉", "欣祥本", "坚源", "成鼎", "世雷", "讯百", "巨中进", "赛苏", "赢时", "缘泰", "荣裕", "光升", "东凯美", "进百", "名财", "信多寿", "复网", "诗琴", "近离", "祥高佳", "尼巨", "艾扬", "兴燕", "中輝", "泰金", "信美如", "仕先", "宏尔", "南旺", "浩宏", "禄福台", "阳恒", "弘汇庆", "罗全", "高贵高", "禾扬", "汇达", "开发区亚弘", "美宏", "康久美", "云博", "昊天金诚", "茂东富", "巨吉", "光长美", "友尼", "天友", "鲜源", "佳世盛", "美乐家", "旺生", "飞恒多", "美婷", "鼎国裕", "博睿精思", "系圣", "优长中", "佳源", "森鑫源", "欧康", "长康复", "山楼", "健创", "升阳", "品臣", "永盛公", "鑫银", "捷德", "汇川", "晖江", "国安全", "宇德", "久长新", "金佳", "速拓科技", "源好", "复通飞", "明精", "祥新", "优元", "天大物贸", "林德", "惠祥博达", "妙硕", "相祥", "灵岛", "公汇耀", "领德", "立缘", "英基", "生本", "协庆顺", "祥久", "鼎铭", "宝康多", "合盛", "蓝月", "长成", "华娜", "禄弘", "合众", "长本", "万坚", "洁明", "干全和", "中鼎寿", "川京", "木隆", "炜烨", "基名", "寿金", "同久富", "频迈", "晶胜", "志诚", "正金晶", "圆和", "辉春", "元高", "悦旋", "昌佳佳", "铁顺", "世用", "金百诚", "天晶", "双川", "多佳", "福禄高", "东威宏", "耀胜", "华安", "欣凯裕", "长如祥", "威宜", "茂安万", "名维", "企家", "兴环宇", "鑫爱", "丰安利", "民泰", "锦程正阳", "圆识", "波菲特", "振铁", "元欧", "盛本荣", "祥富源", "同凯正", "台同", "森宇", "锦秀", "九桥", "利达", "春华长", "泉州荣发", "安全皇", "谦合", "圣尔", "协贵满", "财霸", "雷傲", "吕红发", "玉诺", "福顺德", "广荣", "通特", "乔东化工", "康安", "长惠", "通丰弘", "欣德", "进广", "亚创", "伟高", "皇弘升", "同干亨", "安福优", "元寿", "杭迈", "升厚", "湖远", "裕理", "利亨", "丰公", "林亿", "义浩进", "缘安", "鑫源重工", "全合大", "辉弘汇", "本茂", "协义伟", "永合益", "识瑞", "五丰", "鑫用", "成祥", "鸿迪", "海平线", "金童", "双鑫食品", "奇士", "惠蓝", "文达", "瑞同", "多长满", "晶科", "曼越", "鹏昊", "凌语", "环裕", "金珍", "娇铁", "晨晖", "兴圣欣", "白帝", "长永亚", "隆浩鼎", "洁用", "华德", "利安", "华鲜", "重塑", "正久满", "鼎圣进", "瑞大如", "缘皇", "越生", "辰南", "兴益", "妙吉", "诚泽永信", "韵吉", "腾白", "纳宝", "康环", "多广", "云银臣", "新佳", "奇火", "贵发", "荣恒", "能坚", "立东", "塘沽区震古烁金", "丰庆", "本洪泰", "剑愚", "天丽", "傲中", "先丰", "兴晨", "华中通", "中雅", "健艾", "系百", "千优", "汇诗", "久弘", "佰盈", "成多久", "系易", "信鼎汇", "凌莱", "进益富", "顺瑞", "赛福", "腾金", "皇盛祥", "欣力", "新具", "兴宏泰", "旭圆", "全合伟", "缘贝", "利本", "和磊", "天香", "优恒欣", "纳相", "亚国凯", "嘉营", "千贵厚", "华秀", "宏新泰", "新吉", "欣星", "信杰诚", "优士", "世博", "尚金", "生长旺", "万安", "鼎妙", "祥义巨", "海霆", "如通", "佰仕", "伊斯克拉", "良妙", "鑫泰利发", "华福祥", "格盛", "宏合", "荣和久", "骏兴", "凯瑞特", "康聚如", "影人", "双雷", "元信顺", "中润庆", "兴荣强", "振豪", "满裕隆", "义荣永", "财奥", "润森工贸", "复宏", "合丰", "和永祥", "伊厦", "铭泰", "圣欣", "银蚂蚁", "鑫阳彬", "德旺鑫", "顺高谦", "万谦本", "厚发贵", "光隆同", "旭彩", "萌内朵", "同源", "苏川联志", "昌欣新", "铂盾华宇", "百东", "腾浩", "鑫缘国际", "浩友", "硕裕", "讯诺", "福春金", "洋傲", "义佳", "华如", "帝飞", "格霸", "恒远", "中白", "帝诗", "益信", "上德", "圣米罗", "蓉蓉", "百长", "丰泰", "宝丰", "旭码", "华悦", "聚语", "新盈", "京梦", "丰晶优", "通诚", "亚千贵", "天乐", "复成", "台鑫亨", "相百", "爱包包", "协正久", "双奇", "利伟国", "雄县伟恒", "渤诺", "康顺如", "盈聚通", "聚高圣", "铭悦", "春满鑫", "联能", "俊雅", "久盈干", "禾旭", "天大物贸", "施纳济", "欣苏", "国晶", "伟如", "宝迪", "富林", "唯品", "界铁", "啸恒", "隆恒", "协满", "晶谦兴", "开中", "弘多源", "恒坚", "盛隆益", "银阳", "美本仁", "泰高", "晖界", "益民工贸", "顺谦旺", "九鼎", "缘日", "林世", "皇成满", "高隆盛", "吉川", "圣利", "盛合源", "拓理", "香茗", "众联齐成", "傲尔", "白鼎", "源辉", "博友", "宏仁", "新如荣", "巨福生", "磊利", "新华百货", "荣寿生", "飞世", "通光", "运至", "网凯", "网林", "广中如", "荣薇瑞琪", "复晖", "子程", "木宏", "梦仕", "益合宏", "博琛", "全耀成", "速维", "诺华德", "健旺", "迪派", "美华", "能迪", "祥寿", "先鑫", "昌大通", "鹏远", "同邦", "星相", "百耀欣", "码迪", "元優", "东昌龙", "荣福实业", "顺禄欣", "利复", "源贝", "韓國露韓飾", "生旺康", "邦丰", "浩系", "裕同贵", "景悦", "盛玖", "如百禄",
    };

    private String[] companySuffixes = new String[]{
            "科技有限公司",
            "网络有限公司",
            "信息有限公司",
            "传媒有限公司",
            "实业有限公司"
    };

    @Override
    public Object getFakerData(FakeDataContext context) {
        return RandomUtil.randomEle(companyPrefixes) + RandomUtil.randomEle(companySuffixes);
    }


    @Override
    public String toString() {
        return "公司名称";
    }
}
